In [1]:
import pandas as pd
import numpy as np

In [3]:
data ={
    'credit_score':np.random.randint(300,850,1000),
    'income': np.random.exponential(20000,1000),
    'status':np.random.choice(['approved','denied'],1000)
}
df = pd.DataFrame(data)
df.head(2)

   credit_score        income  status
0           758  31747.019059  denied
1           406  42141.165275  denied

In [5]:
df.head(10)

   credit_score        income    status
0           758  31747.019059    denied
1           406  42141.165275    denied
2           812  23555.199269  approved
3           334  44979.524448  approved
4           322  10387.615954  approved
5           510   3833.747180  approved
6           637  58976.402404    denied
7           504  24975.007135    denied
8           536  51445.731592  approved
9           352    734.509227  approved

In [6]:
sales_data = {
    'product_id': np.arange(1, 101),
    'price': np.random.uniform(5.0, 500.0, 100),
    'discount': np.random.uniform(0.0, 0.3, 100),
    'units_sold': np.random.randint(1, 1000, 100)}
sales_df = pd.DataFrame(sales_data)
sales_df.head(10)

   product_id       price  discount  units_sold
0           1  127.246865  0.038110         780
1           2   84.143326  0.058509         320
2           3  480.883300  0.291315         918
3           4    6.023077  0.041928         572
4           5    7.653526  0.103231           5
5           6  295.106585  0.188292         920
6           7  275.777463  0.293929         586
7           8   60.575260  0.121255         112
8           9  352.524471  0.083296         844
9          10  489.083333  0.279537         363

In [7]:
# unsupervised data
customer_data = {
    'customer_id': np.arange(1, 501),
    'age': np.random.randint(18, 70, 500),
    'annual_income': np.random.normal(60000, 15000, 500),
    'spending_score': np.random.randint(1, 100, 500)
}

customer_df = pd.DataFrame(customer_data)
customer_df.head(10)

   customer_id  age  annual_income  spending_score
0            1   34   72422.941396              49
1            2   21   61951.403525               4
2            3   27   69305.480944              91
3            4   39   62150.758234              41
4            5   59   80276.640152              35
5            6   39   49533.662122              33
6            7   18   66821.246295              27
7            8   50   52729.576720              82
8            9   68   65468.138920               6
9           10   48   70224.982319              76